var datastr="1、海边的曼彻斯特<br />\
	（卡西·阿弗莱克 Casey Affleck 饰）是一名颓废压抑的修理工，在得知哥哥乔伊（凯尔·钱德勒 Kyle Chandler 饰）去世的消息后，李回到了故乡曼彻斯特处理乔伊的后事。根据乔伊的遗嘱，李将会成为乔伊的儿子帕特里克（卢卡斯·赫奇斯 Lucas Hedges 饰）的监护人，李打算将帕特里克带回波士顿，但很显然帕特里克并不愿意离开家乡和朋友们，但李亦不愿在这片伤心地久留。原来，曼彻斯特埋藏着李的一段绝望的回忆，他的过失使得两个女儿葬身火海，妻子兰迪（米歇尔·威廉姆斯 Michelle Williams 饰）亦因此而离开了他。此次重回故乡，李再度见到了已经再婚并且即将做妈妈的兰迪，与此同时，帕特里克那失踪已久的母亲艾丽斯（格瑞辰·摩尔 Gretchen Mol 饰）亦联系上了帕特里克，希望他能够成为她的新家庭中的一员。\
	<br /><br />\
	2、血战钢锯岭<br />\
	1945年，第二次世界大战接近尾声，作为邪恶轴心重要成员的日本，其嚣张态势已成强弩之末。是年，决定战局走向的冲绳岛战役拉开序幕，成千上万斗志昂扬的美国大兵被派往冲绳，等待他们的则是敌军重兵防守、凶险异常的钢锯岭。在这群人中间，却有一个不愿拿起武器的军医。他名叫戴斯蒙德·道斯（安德鲁·加菲尔德 Andrew Garfield 饰），来自美国的弗吉尼亚。太平洋爆发之际，瘦弱的戴斯蒙德志愿成为救死扶伤的军医而应征入伍。可因童年和家庭的原因，他始终不愿拿起枪支操练，为此宁愿背上拒服兵役的罪名被送上军事法庭。几经周折，戴斯蒙德最终和战友来到了钢锯岭。枪林弹雨，转瞬之间无数人应声倒地。在信仰和信念的支持下，戴斯蒙德仅凭一己之力拯救了数十条濒死的生命……\
	<br /><br />\
	3、美国牧歌<br />\
	影片改编自菲利普·罗斯的《美国三部曲：美国牧歌》，讲述了一个生活看似完美的犹太企业家塞莫尔·利沃夫因女儿在反越战浪潮中的恐怖主义行为而遭遇毁灭的故事。\
	<br /><br />\
	4、推销员<br />\
	Emad和Rana所住的居民楼将开展大型工程，小两口不得不搬离这个位于德黑兰市中心的套房，搬入另一所新住房。一场与前房客有关的事故却将这对年轻夫妇的生活搅得天翻地覆。 \
	<br /><br />\
	5、王者<br />\
	全罗南道木浦家途不幸环境中的“朴泰洙”（暂音译 赵寅成饰）成长为一介好事之徒。高中时期目睹偷盗行为的父亲被检察施暴，体悟到权力与力量的重要。虽然奋斗爬上检察官一职，但毫无背景与根基无异于普通上班族。期间了解到权力中心人物检察官“韩强植”（暂音译 郑雨盛饰）并归其麾下。木浦的同乡朋友“崔斗日”（暂音译 柳俊烈饰）帮助其不断扩展势力，然而成功真的如他们所愿一路畅通？金义城饰演组织头目“金应修”（音译），金雅中饰演富家女出身，费心辅助丈夫“朴泰洙”跻身上流社会的“尚熙”（音译），“朴泰洙”其父由郑成模饰演，其妹由郑恩彩饰演。同时黄胜妍，李珠妍也将参演其中。\
	<br /><br />\
	6、葛城事件<br />\
	郊外的某户人家，经营五金店的男主人葛成清（三浦友和 饰）原本和妻子伸子（南果步 饰）拥有幸福的家庭。但不知从何时起，葛城一家渐渐偏离了原有的轨道。长子阿保（新井浩文 饰）听话好学，按照父亲的一员成为商品社会的一员，但是他却无法妥善处理人际关系，内心郁结压抑，渐次走向既定的悲哀结局。次子阿稔（若叶龙也 饰）从小被拿来和哥哥比，内心卑微抗拒。父亲望子成龙，然而个性强硬，让妻儿子女感受到前所未有的压力。直到某天，压抑到极点的阿稔大爆发，酿成了震惊社会的大事件，这无疑加快了葛城一家崩溃的速度\
	<br /><br />\
	7、无名女孩<br />	\
	Jenny是一名年轻的普科医生。一天晚上，在诊所关门后，她听到敲门声却没有开门。第二天，她听说警察在距离诊所不远处，发现了一具身份不明的年轻女孩的尸体。 \
	<br /><br />\
	8、潘菲洛夫28勇士<br />\
	本片讲述二战中的一个著名故事，苏军潘菲洛夫步兵师的２８名士兵在通往莫斯科的地段上消灭了１８辆德军坦克，阻止了德军前进的步伐，苏军只有５人幸存     \
	<br /><br />\
	9、成长边缘<br />\
	娜丁（海莉·斯坦菲尔德 Hailee Steinfeld 饰）从小就是一个性格古怪孤僻不合群的姑娘，因此常常受到同学的欺负。克里斯塔（海莉·路·理查森 Haley Lu Richardson 饰）好像一道光，照亮娜丁的生活，她们从相识起便形影不离，互相分享快乐和秘密，时光荏苒，两个女孩长大走进了高中校园，她们之间的感情从未改变。\
　　娜丁的哥哥达里安（布莱克·詹纳 Blake Jenner 饰）英俊帅气阳光开朗，他的存在衬得愤世嫉俗少年老成的娜丁显得更加不合时宜，但娜丁不在意，因为她拥有克里斯塔的友谊。然而某一日，娜丁震惊的发现克里斯塔和达里安竟然躺到了一张床上，与此同时，娜丁爱上了名为尼克（亚历山大·卡尔弗特 Alexander Calvert 饰）的男生，可她根本无法打入他所在的圈子。\
	<br /><br />\
	10、比利·林恩的中场战事<br />\
	伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。视频公布于世让他成为全美民众所崇拜的英雄，然而却鲜有人理解他和战友们所经历的一切。为了安葬班长，B班得到了短暂的休假，因此他们得以受邀参加一场在德州举行的橄榄球比赛。林恩的姐姐因某事件深感愧疚，她希望弟弟能借此机缘回归普通生活。而周围的经纪人、球迷、大老板、普通民众则对战争、卫国、士兵有着各种各样想当然的理解。球场上的庆典盛大开幕，林恩和战友们的心却愈加沉重与焦躁……\
　　本片根据作家本·方丹（Ben Fountain）的同名小说改编。\
	<br /><br />\
	11、奇异博士<br />\
	斯特兰奇博士（本尼迪克特·康伯巴奇 Benedict Cumberbatch 饰）是一名外科手术医生，他拥有着高超的智商和精湛的技艺，是医院乃至整个医学界的传奇人物。某一日，斯特兰奇博士遭遇了一场可怕的车祸，尽管保住了双手，但这双手伤痕累累不住颤抖，这也就意味着，他再也不能拿起手术刀，站在无影灯下了。\
　　斯特兰奇博士的生活就此失去了意义陷入了绝望之中，他决定远赴尼泊尔，寻找传说中能够治愈他双手的神秘力量。在尼泊尔，风尘仆仆的斯特兰奇博士拜入了神秘的古一法师（蒂尔达·斯文顿 Tilda Swinton 饰）门下，成为了其弟子，与此同时，古一法师曾经的弟子卡西利亚斯（麦斯·米科尔森 饰）亦在虎视眈眈，企图完成他获得永生的大业。\
	<br /><br />\
	12、帕特森<br />\
	帕特森（亚当·德赖弗 Adam Driver 饰）居住在新泽西州帕特森市，这个和故乡有着相同名字的男人是一名巴士司机，和女友劳拉（歌什菲·法拉哈尼 Golshifteh Farahani 饰）以及一只牛头犬一起过着平淡的同居生活，每天开着巴士重复着相同的路线和波澜不惊的人生。帕特森喜欢写诗，他随身携带着一本笔记本，把脑海中跃动的诗句记录在本子上，但从来都没有想过将自己的诗句出版成册，他的唯一读者只有劳拉。\
　　和帕特森截然相反，劳拉是一位天生的艺术家，每天脑袋里都闪现着五花八门的古怪念头，她在窗帘、墙壁甚至自己的衣服上画各种黑白图腾、学吉他、做美味的杯子蛋糕，乐观开朗的她全心全意的热爱着生活。终于，帕特森答应劳拉将自己的作品印刷成册，他的生活是否会因此发生改变呢？\
	13、萨利机长<br />\
	影片根据真实事件改编，2009年1月15日，萨利（汤姆·汉克斯 Tom Hanks 饰）在全美航空1549号班担任机长，飞机起飞两分钟后遭到飞鸟攻击，两架发动机全部熄火，萨利决定在哈德逊河上迫降，155人全数生还。但之后的调查显示他做了错误的抉择，认为大可选择返回拉瓜地亚机场。机内到底发生了什么呢？\
	<br /><br />\
	14、流浪猫鲍勃<br />\
	电影改编自真实事件。家庭的破裂令詹姆斯（卢克·崔德威 Luke Treadaway 饰）遭受了巨大的打击开始自暴自弃，他染上了毒瘾，身无分文，成为了一名流连在街头的卖艺者。瓦尔（琼安·弗洛加特 Joanne Froggatt 饰）是负责詹姆斯的戒毒所医生，在她的帮助下，詹姆斯终于有了一个能够遮风挡雨的家，瓦尔坚信詹姆斯能够凭借自己的意志，彻底摆脱毒品的诱惑。\
　　某日，一只流浪猫闯进了詹姆斯的家，詹姆斯收养了它，给它取名鲍勃，当詹姆斯离开家走上街头卖艺的时候，鲍勃跟在他的身边寸步不离。很快，这一人一猫的组合便吸引了过路人的注意， 詹姆斯的经济状况因此得到了巨大的改善，与此同时，詹姆斯结识了住在隔壁的女子贝拉（鲁塔·盖德敏塔斯 Ruta Gedmintas 饰），在贝拉的身上，詹姆斯重新燃起了对爱的渴望。\
	<br /><br />\
	15、埃塞尔与欧内斯特<br />\
	英国手绘动画电影，改编自Raymond Briggs以其父母真实人生为故事所绘的获奖和畅销绘本，讲述Raymond Briggs的父母，一对普通英国夫妇从1928年初遇相爱到1971年相继离世的故事，日子随男主人的发际线一起消逝，一生平淡无奇但相守终生温情动人，同时也是一部英国编年史，期间穿插着不少的历史事件。\
	<br /><br />\
	16、弗兰兹<br />\
	法国导演弗朗索瓦·欧容在沉寂两年后，终于带着皮埃尔·尼内、葆拉·贝尔主演的《弗兰兹》杀回影坛。影片将以一战后的法国为背景，聚焦贝尔饰演的德国女人正因未婚夫的惨死而悲痛欲绝，尼内饰演的神秘法国男子却悄然出现，默默为其未婚夫墓碑致哀、献花，两人也就此揭开一段匪夷所思的往事。\
	<br /><br />\
	17、佩小姐的奇幻城堡<br />\
	杰克（阿萨·巴特菲尔德 Asa Butterfield 饰）的爷爷自杰克还小的时候，就会常说床边故事给他听，故事中有许多拥有特殊能力的小孩。爷爷神秘死亡后，留下了关于这个属于另一个时空世界种种谜团的线索，杰克循着这些线索，进入了这个神秘的世界，发现这群奇怪的孩子真实存在，他们住在这里是为了躲避可怕的变异怪兽。随着杰克的到来，危险也同时抵达，杰克需要与这群孩子一起，抵御黑暗力量。\
	<br /><br />\
	18、海洋奇缘<br />\
	故事最早始于住在风和海的半神毛伊（道恩·强森 Dwayne Johnson 配音），他偷走了女神的特菲堤之心，导致岩浆魔鬼厄卡陷入疯狂的状态，南太平洋各小岛也面临着毁灭的威胁。一千多年后，某座小岛上的酋长女儿莫阿娜（奥丽依·卡拉瓦霍 Auli'i Cravalho 配音）在父母的呵护下渐渐长大，童年时她曾偶然捡到特菲堤之心，亦曾受到大海的召唤，然而父亲却严厉禁止莫阿娜出海，即使小岛正遭受着死亡的威胁。从奶奶那里，莫阿娜知晓了他们这一族人的历史，于是为了拯救小岛，她依然出海去寻找被困在某地的毛伊，好让他归还特菲堤之心。历经千辛万苦，莫阿娜终于见到了这个传说中的高傲自大的半神。而毛伊则担心特菲堤之心带来霉运拒绝前往。\
　　只不过在命运的指引下，毛伊还是随着莫阿娜踏上未知的征途…… \
	<br /><br />\
	19、你的名字<br />\
	在远离大都会的小山村，住着巫女世家出身的高中女孩宫水三叶（上白石萌音 配音）。校园和家庭的原因本就让她充满烦恼，而近一段时间发生的奇怪事件，又让三叶摸不清头脑。不知从何时起，三叶在梦中就会变成一个住在东京的高中男孩。那里有陌生的同学和朋友，有亲切的前辈和繁华的街道，一切都是如此诱人而真实。另一方面，住在东京的高中男孩立花泷（神木隆之介 配音）则总在梦里来到陌生的小山村，以女孩子的身份过着全新的生活。许是受那颗神秘彗星的影响，立花和三叶在梦中交换了身份。他们以他者的角度体验着对方的人生，这期间有愤怒、有欢笑也有暖心。只是两人并不知道，身份交换的背后隐藏着重大而锥心的秘密……\
　　本片为2016年度日本本土影片票房冠军。\
	<br /><br />\
	20、中邪<br />\
	刘梦（何佳 饰）和丁鑫（董天文 饰）是大学时代的好友，对乡村迷信文化有着很浓厚的兴趣，于是，趣味相投的两人一拍即合，决定拍摄一部与此有关的纪录片。为了获得更多的独家资料，刘梦和丁鑫来到了一处偏僻的村落中，遇见了这里著名的招魂大师王婆（冯丹菊 饰）和王叔（文中学 饰）。跟随着两位老人，刘梦和丁鑫亲眼目睹了充满了诡异气息的“还人”仪式。\
　　村民陈大庆（赵树达 饰）的姐姐陈丽（贺媛媛 饰）着了魔，整个人变得疯疯癫癫，无奈之下，陈大庆请来了王叔王婆进行驱邪，作为旁观者的刘梦和丁鑫并不知道，此时两人已经打开了封印着恐惧和灾难的潘多拉魔盒。\
";

var data=[];
var d=datastr.split("<br /><br />");
function createData(){
	for (var i = 0; i < d.length; i++) {
		 c=d[i].split("<br />");
		data.push({
			caption: c[0].split("、")[1].replace(/\s/g,""),
			img: c[0].split("、")[1]+".jpg",
			desc: c[1].replace(/\s/g,"")
		})
	};
}
createData();
